docs/2020-02-15-1508 Keybindings with leader.el.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2020-10-06 Tue 11:37 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Keybindings with leader</title>
<meta name="generator" content="Org mode">
<link rel='stylesheet' href='static/style.css' type='text/css'/>
</head>
<body>
<div id="preamble" class="status">
<div id='head'>
    <h1><b>zd-tutorial</b></h1>
    &mdash;
    <ul>
        <li><a href='./2020-02-15-1247 Welcome.html'>Welcome</a></li>
        <li><a href='https://efls.github.io/zetteldeft'
	       style='float: right'>Zetteldeft</a></li>
    </ul>
</div>
</div>
<div id="content">
<header>
<h1 class="title">Keybindings with leader</h1>
</header><p>
Backlink: <a href="./2020-01-05-2214 START HERE.html">ยง2020-01-05-2214</a>
</p>

<p>
If you use <code>general.el</code> and like to use leader keys, I suggest the following keybindings:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(general-define-key
  <span style="color: #29838D;">:prefix</span> <span style="color: #4F894C;">"SPC"</span>
  <span style="color: #29838D;">:non-normal-prefix</span> <span style="color: #4F894C;">"C-SPC"</span>
  <span style="color: #29838D;">:states</span> '(normal visual motion emacs)
  <span style="color: #29838D;">:keymaps</span> 'override
  <span style="color: #4F894C;">"d"</span>  '(nil <span style="color: #29838D;">:wk</span> <span style="color: #4F894C;">"deft"</span>)
  <span style="color: #4F894C;">"dd"</span> '(deft <span style="color: #29838D;">:wk</span> <span style="color: #4F894C;">"deft"</span>)
  <span style="color: #4F894C;">"dD"</span> '(zetteldeft-deft-new-search <span style="color: #29838D;">:wk</span> <span style="color: #4F894C;">"new search"</span>)
  <span style="color: #4F894C;">"dR"</span> '(deft-refresh <span style="color: #29838D;">:wk</span> <span style="color: #4F894C;">"refresh"</span>)
  <span style="color: #4F894C;">"ds"</span> '(zetteldeft-search-at-point <span style="color: #29838D;">:wk</span> <span style="color: #4F894C;">"search at point"</span>)
  <span style="color: #4F894C;">"dc"</span> '(zetteldeft-search-current-id <span style="color: #29838D;">:wk</span> <span style="color: #4F894C;">"search current id"</span>)
  <span style="color: #4F894C;">"df"</span> '(zetteldeft-follow-link <span style="color: #29838D;">:wk</span> <span style="color: #4F894C;">"follow link"</span>)
  <span style="color: #4F894C;">"dF"</span> '(zetteldeft-avy-file-search-ace-window <span style="color: #29838D;">:wk</span> <span style="color: #4F894C;">"avy file other window"</span>)
  <span style="color: #4F894C;">"dl"</span> '(zetteldeft-avy-link-search <span style="color: #29838D;">:wk</span> <span style="color: #4F894C;">"avy link search"</span>)
  <span style="color: #4F894C;">"dt"</span> '(zetteldeft-avy-tag-search <span style="color: #29838D;">:wk</span> <span style="color: #4F894C;">"avy tag search"</span>)
  <span style="color: #4F894C;">"dT"</span> '(zetteldeft-tag-buffer <span style="color: #29838D;">:wk</span> <span style="color: #4F894C;">"tag list"</span>)
  <span style="color: #4F894C;">"di"</span> '(zetteldeft-find-file-id-insert <span style="color: #29838D;">:wk</span> <span style="color: #4F894C;">"insert id"</span>)
  <span style="color: #4F894C;">"dI"</span> '(zetteldeft-find-file-full-title-insert <span style="color: #29838D;">:wk</span> <span style="color: #4F894C;">"insert full title"</span>)
  <span style="color: #4F894C;">"do"</span> '(zetteldeft-find-file <span style="color: #29838D;">:wk</span> <span style="color: #4F894C;">"find file"</span>)
  <span style="color: #4F894C;">"dn"</span> '(zetteldeft-new-file <span style="color: #29838D;">:wk</span> <span style="color: #4F894C;">"new file"</span>)
  <span style="color: #4F894C;">"dN"</span> '(zetteldeft-new-file-and-link <span style="color: #29838D;">:wk</span> <span style="color: #4F894C;">"new file &amp; link"</span>)
  <span style="color: #4F894C;">"dr"</span> '(zetteldeft-file-rename <span style="color: #29838D;">:wk</span> <span style="color: #4F894C;">"rename"</span>)
  <span style="color: #4F894C;">"dx"</span> '(zetteldeft-count-words <span style="color: #29838D;">:wk</span> <span style="color: #4F894C;">"count words"</span>))
</pre>
</div>
</div>
</body>
</html>
